۱- جواب تمرین شماره ۱ ( بخش terminal )
mkdir test ( ساخت داریکتوری test )
touch test1.py test2.py ( ساخت چند فایل برای کپی کردن )
cp test1.py test2.py ./test ( کپی کردن فایل های ساخته شده در پوشه test ) 
rm -r test ( حذف دایرکتوری test )

------------------------------------------------------------------------------------------------------------------------------------------

۲ - جواب تمرین شماره ۲ ( بخش terminal )

whatis pwd
pwd (1)              - print name of current/working directory ( نشان دهنده ادرس دایرکتوری از root )

------------------------------------------------------------------------------------------------------------------------------------------

whatis rmdir
rmdir (1)            - remove empty directories
rmdir (2)            - delete a directory ( حذف دایرکتوری های خالی یا غیر خالی )

------------------------------------------------------------------------------------------------------------------------------------------

whatis find
find (1)             - search for files in a directory hierarchy ( پیدا کردن فایل در سیستم )

------------------------------------------------------------------------------------------------------------------------------------------

whatis stat
stat (1)             - display file or file system status
stat (2)             - get file status ( نشان دهنده وضعیت فایل ها در دایرکتوری ) 

------------------------------------------------------------------------------------------------------------------------------------------

 whatis cat
cat (1)              - concatenate files and print on the standard output ( چاپ یک فایل و نمایش آن در ترمینال )

------------------------------------------------------------------------------------------------------------------------------------------

whatis wc
wc (1)               - print newline, word, and byte counts for each file ( نشان دهنده تعداد خطوط و کلمات و بایت های یک فایل )

